---
type: ExternalApplicationArray
namespace: Autodesk.Revit.UI
version: 2024
members: 10
tags: [revit-api, class]
---

# ExternalApplicationArray

`Autodesk.Revit.UI.ExternalApplicationArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExternalApplicationArray | — | `public ExternalApplicationArray ()` |
| Method | Append | — | `public virtual void Append ( IExternalApplication item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual ExternalApplicationArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( IExternalApplication item , int index )` |
| Method | ReverseIterator | — | `public virtual ExternalApplicationArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual IExternalApplication this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |